# 1. **Калькулятор возраста**
#    Напиши программу, которая спрашивает год рождения пользователя и выводит, сколько ему лет сейчас.

print("Type in your year of birth: ")
age = int(input(">"))
print("You are " + str(2025-age)+" years old")

# 2. **Сумма трёх чисел**
#    Пользователь вводит три числа. Программа выводит их сумму, произведение и среднее арифметическое.

a = int(input("a = "))
b = int(input("b = "))
c = int(input("c = "))
print("Sum = " + str(a+b+c) + "; product = " + str(a*b*c) + "; avg = " + str((a+b+c)/3))

# 3. **Повторяйка**
#    Пользователь вводит строку и число `n`. Программа выводит эту строку, повторённую `n` раз.

# 4. **Длина имени**
#    Запросить имя пользователя и вывести сообщение вида:
#    `"Твоё имя — <имя>. Оно состоит из <кол-во букв> букв."`

# 5. **Квадраты чисел**
#    Считать число `n` и вывести квадраты всех чисел от 1 до `n`.

# 6. **Конкатенатор**
#    Запросить у пользователя два слова и вывести их соединёнными через пробел и без пробела.

# 7. **Абсолют и округление**
#    Пользователь вводит дробное число. Выведи его:

#    * округлённое,
#    * округлённое до 2 знаков после запятой,
#    * абсолютное значение.

# 8. **Остаток деления**
#    Запроси у пользователя два числа и выведи:

#    * результат деления,
#    * целую часть деления,
#    * остаток.

# 9. **Следующий год**
#    Программа спрашивает возраст и выводит:
#    `"Через год тебе будет X лет"`.

# 10. **Тип данных**
#     Запросить у пользователя строку и вывести её тип данных (`type()`), а затем преобразовать её в число и показать новый тип.

